# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],    # 3   0
   [-1, 1, Conv, [128, 3, 2]],      # 4   1
   [-1, 1, DCN, [128, 3, 1]],       # 6   2
   [-1, 3, C3, [128]],              # 7   3
   [-1, 1, Conv, [256, 3, 2]],      # 8   4
   [-1, 1, DCN, [128, 3, 1]],       # 10    5
   [-1, 6, C3, [256]],              # 11    6
   [-1, 1, Conv, [512, 3, 2]],      # 12    7
   [-1, 1, DCN, [128, 3, 1]],       # 14    8
   [-1, 9, C3, [512]],              # 15    9
   [-1, 1, Conv, [1024, 3, 2]],     # 16    10
   [-1, 3, C3, [1024]],             # 17    11
   [-1, 1, SPPF, [1024, 5]],        # 18    12
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 19    13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 20    14
   [[-1, 9], 1, Concat, [1]],                    # 21    15  
   [-1, 3, C3, [512, False]],                     # 22    16

   [-1, 1, Conv, [256, 1, 1]],                    # 23    17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 24    18
   [[-1, 6], 1, Concat, [1]],                    # 25    19
   [-1, 3, C3, [256, False]],                     # 26    20

   [-1, 1, Conv, [256, 3, 2]],                    # 27    21
   [[-1, 17], 1, Concat, [1]],                    # 28    22  
   [-1, 3, C3, [512, False]],                     # 29    23

   [-1, 1, Conv, [512, 3, 2]],                    # 30    24
   [[-1, 13], 1, Concat, [1]],                    # 31    25
   [-1, 3, C3, [1024, False]],                    # 32    26

   [[20, 23, 26], 1, Detect, [nc, anchors]],      # 33
  ]
